Tekla Open API Reference for Tekla Structures 2025
ReinforcementSingleAttributes Constructor
Overload List
Name | Description
ReinforcementBase.ReinforcementSingleAttributes()
 Creates a new default reinforcement attributes instance that loads standard attributes.
ReinforcementBase.ReinforcementSingleAttributes(String)
 Creates a new reinforcement attributes instance that loads the specified attributes.
Top
See Also
Reference
ReinforcementBase.ReinforcementSingleAttributes Class
Tekla.Structures.Drawing Namespace